Revit 2026 API

# SolidOrShellTessellationControlsLevelOfDetail Property

---

An number between 0 and 1 (inclusive) specifying the level of detail for the triangulation of a solid or shell.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double LevelOfDetail { get; set; }
```
```vb
Public Property LevelOfDetail As Double
	Get
	Set
```
```cpp
public:
property double LevelOfDetail {
	double get ();
	void set (double value);
}
```
```fsharp
member LevelOfDetail : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for levelOfDetail must lie between 0 and 1 (inclusive). |

Smaller values yield coarser triangulations (fewer triangles), while larger values yield finer triangulations (more triangles).

#### Reference

SolidOrShellTessellationControls Class

Autodesk.Revit.DB Namespace